app/controllers/articles_controller.rb

INSERT INTO "articles" ("active", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["active", "f"], ["created_at", "2015-02-26 09:42:43.357381"], ["name", "fsdfsdf"], ["updated_at", "2015-02-26 09:42:43.357381"]]
---
  def create

    @article.save

UPDATE "articles" SET "active" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["active", "f"], ["updated_at", "2015-02-24 11:09:55.131275"]]
---
  def enable
    @article.active = false
    #if can? :enable, @article
      @article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = 1 LIMIT 1
---
    def load_article
      @article = Article.find_by(id: 1)