app/controllers/payments_controller.rb

  def create
    @subscription = Subscription.new(subscription_params)
    @subscription.save_with_payment
---
INSERT INTO "subscriptions" ("email") VALUES ($1) RETURNING "id"  [["email", "dilpreet@vinsol.com"]]